In [63]:
import numpy as np
import pandas as pd
import warnings

warnings.filterwarnings("ignore")

In [78]:
m_titles = ["user_id","item_id","rating","timestamp"]
df = pd.read_csv("movie_dataset/u.data", sep="\t",names=m_titles)
df.head(n=1)

   user_id  item_id  rating  timestamp
0      196      242       3  881250949

In [79]:
df1 = pd.read_csv("movie_dataset/u.item", sep="\|",encoding="ISO-8859-1",header=None)
df1.head(n=1)

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0

In [80]:
df1 = df1[[0,1]]

In [81]:
df1.columns = ["item_id","title"]
df1.head(n=1)

   item_id             title
0        1  Toy Story (1995)

In [82]:
df1.shape

(1682, 2)

In [83]:
df = pd.merge(df,df1,on="item_id")

In [89]:
df.head(n=3)

   user_id  item_id  rating  timestamp         title
0      196      242       3  881250949  Kolya (1996)
1       63      242       3  875747190  Kolya (1996)
2      226      242       5  883888671  Kolya (1996)

In [91]:
import matplotlib.pyplot as plt
import seaborn as sns

In [106]:
df.groupby("title").mean()["rating"].sort_values(ascending = False).head(n=1)

title
They Made Me a Criminal (1939)    5.0
Name: rating, dtype: float64

In [107]:
df.groupby("title").count()["rating"].head(n=1)

title
'Til There Was You (1997)    9
Name: rating, dtype: int64

In [109]:
rating = pd.DataFrame(df.groupby("title").mean()["rating"])

In [110]:
rating["num of rating"] =

                                         rating
title
'Til There Was You (1997)              2.333333
1-900 (1994)                           2.600000
101 Dalmatians (1996)                  2.908257
12 Angry Men (1957)                    4.344000
187 (1997)                             3.024390
...                                         ...
Young Guns II (1990)                   2.772727
Young Poisoner's Handbook, The (1995)  3.341463
Zeus and Roxanne (1997)                2.166667
unknown                                3.444444
Á köldum klaka (Cold Fever) (1994)     3.000000

[1664 rows x 1 columns]